//========================================================
// #6 Напишите программу которая на вход принимает число 
// и является четным (т.е. делится без остатка на 2)
// =======================================================


string? inputLineA = Console.ReadLine(); //считали первое число от пользователя 

        
if (inputLineA != null) // проверили что было не было пустым

{
    int inputNumberA = int.Parse(inputLineA); // превратили значение в целое число
    int R = inputNumberA%2;


 if (R  == 0)
    {
        Console.WriteLine("Число четное");
    }
        else
        Console.WriteLine("Число не четное");
}
    
